In [31]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [32]:
data = pd.read_csv(r"Bank Customer Churn Prediction.csv",)

In [34]:
data.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

#### Data Exploration

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       10000 non-null  int64
 1   credit_score      10000 non-null  int64
 2   country           10000 non-null  object
 3   gender            10000 non-null  object
 4   age               10000 non-null  int64
 5   tenure            10000 non-null  int64
 6   balance           10000 non-null  float64
 7   products_number   10000 non-null  int64
 8   credit_card       10000 non-null  int64
 9   active_member     10000 non-null  int64
 10  estimated_salary  10000 non-null  float64
 11  churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

In [36]:
data.isna().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

In [37]:
data.duplicated().sum()

np.int64(0)

In [38]:
data.churn.value_counts()

churn
0    7963
1    2037
Name: count, dtype: int64

In [39]:
data.churn.value_counts()/100

churn
0    79.63
1    20.37
Name: count, dtype: float64

In [40]:
data.credit_score.nunique()

460

In [41]:
data.credit_score.unique().max()

np.int64(850)

In [42]:
data.credit_score.unique().min()

np.int64(350)

In [43]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
customer_id,10000.0,1.569094e+07,71936.186123,15565701.00,15628528.25,1.569074e+07,1.575323e+07,15815690.00
credit_score,10000.0,6.505288e+02,96.653299,350.00,584.00,6.520000e+02,7.180000e+02,850.00
age,10000.0,3.892180e+01,10.487806,18.00,32.00,3.700000e+01,4.400000e+01,92.00
tenure,10000.0,5.012800e+00,2.892174,0.00,3.00,5.000000e+00,7.000000e+00,10.00
balance,10000.0,7.648589e+04,62397.405202,0.00,0.00,9.719854e+04,1.276442e+05,250898.09
products_number,10000.0,1.530200e+00,0.581654,1.00,1.00,1.000000e+00,2.000000e+00,4.00
credit_card,10000.0,7.055000e-01,0.455840,0.00,0.00,1.000000e+00,1.000000e+00,1.00
active_member,10000.0,5.151000e-01,0.499797,0.00,0.00,1.000000e+00,1.000000e+00,1.00
estimated_salary,10000.0,1.000902e+05,57510.492818,11.58,51002.11,1.001939e+05,1.493882e+05,199992.48
churn,10000.0,2.037000e-01,0.402769,0.00,0.00,0.000000e+00,0.000000e+00,1.00

In [44]:
# getting list of columns
columns = data.columns.values.tolist()
columns

['customer_id',
 'credit_score',
 'country',
 'gender',
 'age',
 'tenure',
 'balance',
 'products_number',
 'credit_card',
 'active_member',
 'estimated_salary',
 'churn']

In [45]:
# remving Id column or unsignificant columns
df = data.drop('customer_id',axis=1)

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   credit_score      10000 non-null  int64
 1   country           10000 non-null  object
 2   gender            10000 non-null  object
 3   age               10000 non-null  int64
 4   tenure            10000 non-null  int64
 5   balance           10000 non-null  float64
 6   products_number   10000 non-null  int64
 7   credit_card       10000 non-null  int64
 8   active_member     10000 non-null  int64
 9   estimated_salary  10000 non-null  float64
 10  churn             10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [47]:
df = df.drop(['country','gender'],axis=1)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   credit_score      10000 non-null  int64
 1   age               10000 non-null  int64
 2   tenure            10000 non-null  int64
 3   balance           10000 non-null  float64
 4   products_number   10000 non-null  int64
 5   credit_card       10000 non-null  int64
 6   active_member     10000 non-null  int64
 7   estimated_salary  10000 non-null  float64
 8   churn             10000 non-null  int64
dtypes: float64(2), int64(7)
memory usage: 703.3 KB

In [49]:
# converting catagorical value into numerical values
country = pd.get_dummies(data.country).iloc[:,1:]

In [50]:
country

      Germany  Spain
0       False  False
1       False   True
2       False  False
3       False  False
4       False   True
...       ...    ...
9995    False  False
9996    False  False
9997    False  False
9998     True  False
9999    False  False

[10000 rows x 2 columns]

In [51]:
country = pd.get_dummies(data.country,dtype='int').iloc[:,1:]

In [52]:
country

      Germany  Spain
0           0      0
1           0      1
2           0      0
3           0      0
4           0      1
...       ...    ...
9995        0      0
9996        0      0
9997        0      0
9998        1      0
9999        0      0

[10000 rows x 2 columns]

In [ ]:
gender = pd.get_dummies(data.gender,dtype='int').iloc[:,1:] # always after complting this step n-1 columns will be come becasue to avoid dummy variable trap

In [54]:
df = pd.concat([df,country,gender],axis=1)

In [55]:
df.head()

,credit_score,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn,Germany,Spain,Male
0,619,42,2,0.00,1,1,1,101348.88,1,0,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,0,1,0
2,502,42,8,159660.80,3,1,0,113931.57,1,0,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,0,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,0,1,0

#### additional derived columns in data set could be debt/credit transacions in various periods and average balance in 1 year or 6 months ,3 months
#### cibl score, vintage(means how long customer is staying with the bank) ,year,quater,month,zone, region

In [56]:
X = df.drop('churn',axis=1)
Y = df['churn']

In [ ]:
#
from statsmodels.stats.outliers_influence import variance_inflation_factor
vif = pd.DataFrame()
vif['VIF'] = [variance_inflation_factor(X.values,i) for i in range(X.shape[1])]
vif['variables'] = X.columns
vif

          VIF         variables
0   21.236445      credit_score
1   12.334128               age
2    3.872755            tenure
3    3.182267           balance
4    7.826417   products_number
5    3.289605       credit_card
6    2.075966     active_member
7    3.887186  estimated_salary
8    1.787170           Germany
9    1.486247             Spain
10   2.168988              Male

In [62]:
from sklearn.model_selection import  train_test_split
x_train,x_test,y_train,y_test = train_test_split(X,Y, test_size=0.2,random_state=42)

In [64]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier(n_estimators=200,random_state=42)
clf.fit(x_train,y_train)
predictions = clf.predict(x_test)

In [ ]:
from sklearn.metrics import classification_report,accuracy_score
print()
print(classification_report(y_test,predictions))
print(accuracy_score(y_test,predictions))

              precision    recall  f1-score   support

           0       0.88      0.97      0.92      1607
           1       0.78      0.48      0.59       393

    accuracy                           0.87      2000
   macro avg       0.83      0.72      0.76      2000
weighted avg       0.86      0.87      0.86      2000

0.8705

In [66]:
from xgboost import XGBClassifier
model = XGBClassifier()
model.fit(x_train,y_train)
predict = model.predict(x_test)
print(classification_report(y_test,predict))
print(accuracy_score(y_test,predict))

              precision    recall  f1-score   support

           0       0.89      0.95      0.92      1607
           1       0.71      0.51      0.60       393

    accuracy                           0.86      2000
   macro avg       0.80      0.73      0.76      2000
weighted avg       0.85      0.86      0.86      2000

0.864